added readme with system diagram
